[
    {
        "Date":"25/09/18",
        "Text": [
            "From what I could tell without having access to the register the class seemed to be full with a large number of students turning up for the lesson and only one or two empty seats. Before the class began a number of students logged on and began to go into the VLE area to start look at what they needed to do for the class. When the lesson began every student listened to the instructions they were given and marked themselves as in (Two students were slightly late but came into class before any information had been given). With all the students in there were no students sat on their own with everyone having at least one person around them and communication between students being consistent when they needed help to find anything.",
            "With this lesson being the first to use Alice 3 this lesson got off to a slow start with students finding where the program was stored, this did not take up too much time but one student (Student A) is in the process of transferring onto this course and as a result did not have access to the program; This was solved by student assistant A when Alice was found on another of the network drives. Once each student had started using Alice the class began moving though the tasks for this week (this did take a little longer than it should have to set up as the students had not been given access to the area on blackboard until later in the lesson). All of the students made great progress though the tasks with a number needing only minimal direction in order to get passed an issue they were facing. The majority of students did not require much in the way of guidance in order to find the solution they needed to; However to my knowledge no students were able to complete all of the work laid out for this week. A number of students asked at the end of class if they would be able to get Alice themselves so that they could finish the work, they were told that they can download it for free and that all of the computers in the hub and library should also have access so they should be able to get the work finished."
        ]
    },
    {
        "Date":"02/10/18",
        "Text":[
            "This class had a number of students missing with the end number of attendees being 32 as opposed to the 39 expected. The majority of the students got on with the work straight away asking for help when they needed it or making use of their peers. A minority of students did not put too much time or effort into the work but most of these students did spend their time playing about with the ideas taught. Student B at the start of the lesson complained that their pc was not working properly with microsoft edge, this issue was raised to the technical team who were unable to fix it then and there, this student was informed the issue could not be resolved but would be in time and went about the lesson as normal but made it know he was not too pleased with the issue persisting. One student also asked how they would go about getting a day as absent with reason as they had a funeral to attend, I told them to either email computing admin or talk to sally about it and it would get sorted, they then continued to work on the tutorials.",
            "The lesson went on with the students mostly putting time into completing the work set with a number of questions and issues thought the session. The majority of the issues raised were not too difficult to help with, primarily being to do with parts of the task being missed or the students being unable to find the specific function etc. to use. Throughout the class the students seemed to have no issue in talking amongst themselves to try and solve issues as well as getting to know each other; The one exception to this was Student C who did not engage with any other students and ignored me twice when I tried to make conversation with them. The students made a large amount of progress thought the tasks they had been set with a number asking for clarification on the difference between functions and variables which I explained as simply as I could, as well as helping to produce an example in alice so they could see the practical implementation."
        ]
    },
    {
        "Date":"09/10/18",
        "Text":[
            "This class had a number of students missing with the end number of attendees being 32 as opposed to the 39 expected. The majority of the students got on with the work straight away asking for help when they needed it or making use of their peers. A minority of students did not put too much time or effort into the work but most of these students did spend their time playing about with the ideas taught. Student B at the start of the lesson complained that their pc was not working properly with microsoft edge, this issue was raised to the technical team who were unable to fix it then and there, this student was informed the issue could not be resolved but would be in time and went about the lesson as normal but made it know he was not too pleased with the issue persisting. One student also asked how they would go about getting a day as absent with reason as they had a funeral to attend, I told them to either email computing admin or talk to sally about it and it would get sorted, they then continued to work on the tutorials.",
            "The lesson went on with the students mostly putting time into completing the work set with a number of questions and issues thought the session. The majority of the issues raised were not too difficult to help with, primarily being to do with parts of the task being missed or the students being unable to find the specific function etc. to use. Throughout the class the students seemed to have no issue in talking amongst themselves to try and solve issues as well as getting to know each other; The one exception to this was Student C who did not engage with any other students and ignored me twice when I tried to make conversation with them. The students made a large amount of progress thought the tasks they had been set with a number asking for clarification on the difference between functions and variables which I explained as simply as I could, as well as helping to produce an example in alice so they could see the practical implementation."
        ]
    },
    {
        "Date":"16/10/18",
        "Text":[
            "Before the start of the session I told the GTA that I would be covering for another of the coaching learners, CLA, as they would not be able to take their class for today's session, I said I would make an effort to be in both classes and help students wherever I could when they needed it. This class had a large number of the students turn up with no notable absence and all of the students getting on with the work. Once everyone had signed in to the register the GTA asked if I would talk the class though the topic of the session, expressions and statements,  I said that I would and had a little bit of time to prepare before I would be required to take the class. When I began to teach it took a little bit of time for the students to quiet down and start to listen but once they did the majority seemed engaged, I went over what was required and went into detail explaining the different type of operators, both arithmetic and logical; Whilst also touching on bitwise. I made a point to explain how expressions and statements differ and asked the students if they had any questions and if what I had said made sense, none of them had any questions to ask so I assumed that they did and let them get on with the work they had to complete. There were three students that asked for some clarification as to the lecture I had given at the start of the lesson as they had followed along but were unsure as to how this would translate into working in Alice, I told them that the base principles would be the same but it would be easier to follow with the java code view open so they could see how it would be built.",
            "Because I was also covering CLA’s class in this session I spent some time going between the two to make sure that the students in both were able to get their work done. Both classes were able to get on with the work only needing a little bit of help with some issues along the lines of statements being slightly wrong or clarification as to how what they were doing worked and why it would be something they would need to know; I answered all of the questions as best I could and was able to solve all of the issues that students were facing. The students managed to get on with the task quickly and effectively with a small number using the time to finish the work that they needed to hand in at 12 today, the students doing this had finished the exercises for today's session so I let them carry on. I feel that this session has taken me out of my comfort zone in a number of ways primarily as I was asked to give a lecture, which I had not done before, and also as I needed to make sure I was available to help in both classes when I was needed. My lecturer seemed to go down well with the majority of the students getting a good understanding of the material taught. The interaction with the new class went well but I feel could have gone better and not a large number of students asked for or needed help, I feel this may have been partially due to the fact that they did not know me, but for the students that did need help they seemed to follow my explanations well and managed to solve the problems they had."
        ]
    }
]