[
    {
        "Date":"25/09/18",
        "Text": [
            "From what I could tell without having access to the register the class seemed to be full with a large number of students turning up for the lesson and only one or two empty seats. Before the class began a number of students logged on and began to go into the VLE area to start look at what they needed to do for the class. When the lesson began every student listened to the instructions they were given and marked themselves as in (Two students were slightly late but came into class before any information had been given). With all the students in there were no students sat on their own with everyone having at least one person around them and communication between students being consistent when they needed help to find anything.",
            "With this lesson being the first to use Alice 3 this lesson got off to a slow start with students finding where the program was stored, this did not take up too much time but one student (Student A) is in the process of transferring onto this course and as a result did not have access to the program; This was solved by student assistant A when Alice was found on another of the network drives. Once each student had started using Alice the class began moving though the tasks for this week (this did take a little longer than it should have to set up as the students had not been given access to the area on blackboard until later in the lesson). All of the students made great progress though the tasks with a number needing only minimal direction in order to get passed an issue they were facing. The majority of students did not require much in the way of guidance in order to find the solution they needed to; However to my knowledge no students were able to complete all of the work laid out for this week. A number of students asked at the end of class if they would be able to get Alice themselves so that they could finish the work, they were told that they can download it for free and that all of the computers in the hub and library should also have access so they should be able to get the work finished."
        ]
    },
    {
        "Date":"02/10/18",
        "Text":[
            "This class had a number of students missing with the end number of attendees being 32 as opposed to the 39 expected. The majority of the students got on with the work straight away asking for help when they needed it or making use of their peers. A minority of students did not put too much time or effort into the work but most of these students did spend their time playing about with the ideas taught. Student B at the start of the lesson complained that their pc was not working properly with microsoft edge, this issue was raised to the technical team who were unable to fix it then and there, this student was informed the issue could not be resolved but would be in time and went about the lesson as normal but made it know he was not too pleased with the issue persisting. One student also asked how they would go about getting a day as absent with reason as they had a funeral to attend, I told them to either email computing admin or talk to sally about it and it would get sorted, they then continued to work on the tutorials.",
            "The lesson went on with the students mostly putting time into completing the work set with a number of questions and issues thought the session. The majority of the issues raised were not too difficult to help with, primarily being to do with parts of the task being missed or the students being unable to find the specific function etc. to use. Throughout the class the students seemed to have no issue in talking amongst themselves to try and solve issues as well as getting to know each other; The one exception to this was Student C who did not engage with any other students and ignored me twice when I tried to make conversation with them. The students made a large amount of progress thought the tasks they had been set with a number asking for clarification on the difference between functions and variables which I explained as simply as I could, as well as helping to produce an example in alice so they could see the practical implementation."
        ]
    },
    {
        "Date":"09/10/18",
        "Text":[
            "This class had a number of students missing with the end number of attendees being 32 as opposed to the 39 expected. The majority of the students got on with the work straight away asking for help when they needed it or making use of their peers. A minority of students did not put too much time or effort into the work but most of these students did spend their time playing about with the ideas taught. Student B at the start of the lesson complained that their pc was not working properly with microsoft edge, this issue was raised to the technical team who were unable to fix it then and there, this student was informed the issue could not be resolved but would be in time and went about the lesson as normal but made it know he was not too pleased with the issue persisting. One student also asked how they would go about getting a day as absent with reason as they had a funeral to attend, I told them to either email computing admin or talk to sally about it and it would get sorted, they then continued to work on the tutorials.",
            "The lesson went on with the students mostly putting time into completing the work set with a number of questions and issues thought the session. The majority of the issues raised were not too difficult to help with, primarily being to do with parts of the task being missed or the students being unable to find the specific function etc. to use. Throughout the class the students seemed to have no issue in talking amongst themselves to try and solve issues as well as getting to know each other; The one exception to this was Student C who did not engage with any other students and ignored me twice when I tried to make conversation with them. The students made a large amount of progress thought the tasks they had been set with a number asking for clarification on the difference between functions and variables which I explained as simply as I could, as well as helping to produce an example in alice so they could see the practical implementation."
        ]
    },
    {
        "Date":"16/10/18",
        "Text":[
            "Before the start of the session I told the GTA that I would be covering for another of the coaching learners, CLA, as they would not be able to take their class for today's session, I said I would make an effort to be in both classes and help students wherever I could when they needed it. This class had a large number of the students turn up with no notable absence and all of the students getting on with the work. Once everyone had signed in to the register the GTA asked if I would talk the class though the topic of the session, expressions and statements,  I said that I would and had a little bit of time to prepare before I would be required to take the class. When I began to teach it took a little bit of time for the students to quiet down and start to listen but once they did the majority seemed engaged, I went over what was required and went into detail explaining the different type of operators, both arithmetic and logical; Whilst also touching on bitwise. I made a point to explain how expressions and statements differ and asked the students if they had any questions and if what I had said made sense, none of them had any questions to ask so I assumed that they did and let them get on with the work they had to complete. There were three students that asked for some clarification as to the lecture I had given at the start of the lesson as they had followed along but were unsure as to how this would translate into working in Alice, I told them that the base principles would be the same but it would be easier to follow with the java code view open so they could see how it would be built.",
            "Because I was also covering CLA’s class in this session I spent some time going between the two to make sure that the students in both were able to get their work done. Both classes were able to get on with the work only needing a little bit of help with some issues along the lines of statements being slightly wrong or clarification as to how what they were doing worked and why it would be something they would need to know; I answered all of the questions as best I could and was able to solve all of the issues that students were facing. The students managed to get on with the task quickly and effectively with a small number using the time to finish the work that they needed to hand in at 12 today, the students doing this had finished the exercises for today's session so I let them carry on. I feel that this session has taken me out of my comfort zone in a number of ways primarily as I was asked to give a lecture, which I had not done before, and also as I needed to make sure I was available to help in both classes when I was needed. My lecturer seemed to go down well with the majority of the students getting a good understanding of the material taught. The interaction with the new class went well but I feel could have gone better and not a large number of students asked for or needed help, I feel this may have been partially due to the fact that they did not know me, but for the students that did need help they seemed to follow my explanations well and managed to solve the problems they had."
        ]
    },
    {
        "Date":"23/10/18",
        "Text":[
            "Before the start of this class I was asked to go around and ask every student their opinion of Alice and how much programming they did outside of the sessions. Due to this I spent the entire lesson going though the class asking every student and writing down their responses. This lined up well with the work required in this session as the majority of the students did not have any programming to do and were using their time to read about exceptions and interrupts meaning I was not asked for help and was able to continue asking for opinions. 34 students in total attended this lesson and I was able to ask everyone what they thought, the majority of the responses were a mixed bag with both negative and positive points being made; However the majority of students were not putting time in outside of the sessions to gain a better understanding of programming. Some students were putting effort into learning more but primarily for different languages and felt they were getting a better knowledge base for the concepts and overall logic of programming by doing so.",
            "With this session requiring me to speak to each and every student in the class I have managed to get a better understanding of every individuals skill level as well as how they feel about Alice and programming over all. The session also allowed both myself and the students to get to know one another as a few of the students I had not previously had much interaction with. The answers I received helped me to offer some tips as well as letting them know that they can ask me for explanations as well as help with programming so if there is anything they don’t quite get I’ll be happy to help. The students were also forming the teams that they would be staying in for the production of the project for this module and as a result a large number were curious as to what they would be required to do as well as finding out who would be good to work with; Every student managed to find a team and most began thinking about what the project could be and trying to come up with ideas for this."
        ]
    },
    {
        "Date":"06/11/18",
        "Text":[
            "This class is the first to have the students in the teams they have built for the development of the game they will be marked on so the class had the students working in their teams. The lesson had a number of students absent but all of the students that were present had all or most of their team members with them. The students seemed to have a good grasp of what is required for the project with a number of teams making a large amount of progress towards the end goal. The majority of the students had not considered adding an educational aspect to the games that they are building but when this had been suggested the majority of the team began to weave this into their work. The GTA asked me to give the students an idea of the work that I conducted when I was in first year so that they could have a better understanding of the direction they should take in the development. I talked about how my team split the work up with all aspects of the project, report and development, and how this allowed the work conducted to be tracked as well as reducing the amount of time taken to develop the project. A number of students asked how they should go about developing the game with each member contributing and if they could copy code from one scene to another; I explained that this is not easy to do and as a result the easiest way to develop the game is to have a single main scene and other members developing aspects of the game to then build this again in the main scene.",
            "There was a clear divide between how the different teams approached the project development with some students focusing on the report side and others setting up the game as quickly as they could. I will keep a close eye on the directions of the different teams to make sure that they are all making progress. The different ideas for the games that I was able to see were relatively varied but a number seemed to be similar however the ideas from the initial concept look to be building upon this in very different ways. The students needed some help with different issues, some to do with Alice and others to do with the way they should go about producing the report. The issues with Alice were to do with not being able to find the function that would help them achieve what they wanted to and as a result I helped by giving them direction as well as fleshing out the idea they had to solve the problem they were facing. The issues with the report were more about when they should start as well as the structure they should use; The students I spoke to were under the impression they could not start the report until they had finished the game so I detailed all the work they could start without needing the game done as well as the type of content they should include."
        ]
    },
    {
        "Date":"13/11/18",
        "Text":[
            "This class is the second I have attended where the students were left to get on with the development of their game for this module. Because the students were using this lesson to work on their projects I spent my time making sure I was available to help where they needed me. I spend the first part of the lesson helping where I could with some issues to do with the development the teams were undertaking. Some of the groups were not present and as a result it is unlikely they will be able to keep up with the development. The majority of the students are making good progress with their teams being split having each individual responsible for part of the work, this is something that I had suggested to them during the initial stages of the development. This class does not appear to have put too much time into the development of the report for this work and as a result I have informed them that this is an important bit and they should get started with it as soon as they can. ",
            "I was asked to cover TeacherA’s class while they gave each programming class required information on parts of the work that they needed to complete; As a result of this I was in a class I had not previously taken and did not know any of the students. I spent some time going round and asking the students how their work was going as a way to break the ice so that they would feel comfortable asking me for help. The games that were being produced appeared to be moving along well but there were a few teams that needed help with figuring out how they would work as a team to develop the game so I gave them a pointer in using one scene as the main game with the other members of the team working on the bits to include. I managed to build up rapport quickly with students feeling comfortable asking me for help or my opinion within the short amount of time I was in the class. ",
            "When I was able to return to my class I caught up with some of the students who had asked me for help, one team had managed to fix the issues that they had been having with another ignoring the problem until I got back. The team that had fixed the issue had managed to get a lot done and improve their game a large amount, the team that had waited had not managed to do much passed the last time I saw their game. I had been in the other class for 45 minutes and as a result I expected more to have been done, some teams had made great progress where others had hit problems and stopped. At the end of the class I was asked to give the students an update as to the work that they needed to get done with the presentation as the GTA had started to lose their voice so would not be able to speak loud enough; I gave this update with the majority of the students listening to me and taking it in but small pockets of people continuing to talk after I had started."
        ]
    },
    {
        "Date":"20/11/18",
        "Text":[
            "This lesson again has been set to allow the students to work on their group project with my involvement in the class being to support them with the development. One of the other CLA (CLA A) was ill for this session and as a result I said that I would keep an eye on their class as well as my own. The majority of the students in this session were using the time to work on their game and as a result I spent the majority of my time helping with the development for both of the classes. In my own class the students knew what they wanted to happen and were going about setting this up correctly but were missing little bits like setting global variables locally so they had no effect; these issues were resolved with minimal input but I made sure that the students could explain why it wasn’t working and why it did after the fix had been applied. The second class that I helped had similar issues but also some caused by the scope of the project with one team having an Alice scene of over 300 different objects, this obviously caused a large amount of slow down within Alice both while editing and while the game was running. The only suggestion I could give for this was to have the students reduce the size, this would take a large amount of time but would solve the issue they were facing.",
            "The majority of the help I gave in both classes involved pointing the students in the right direction so that they could fix their own issues but there were occasions were the students required a large amount of help to understand their problem. The issue this team was facing involved a piece of code they wanted to have repeat but they could not think of how to do this, I suggested that they used a loop and changed the condition when they wanted to exit it; I left them to it in the hopes that they would be able to get this working. When I came back to ask if they had managed to get it working they informed me that they had tried but it did not seem to work, when I asked what they had tried it became clear that they had not understood the direction I had tried to give them. Due to this team not understanding I spent some time explaining how to implement the loop to get the desired effect, I could tell that they were unable to follow so I set up how the loop should run and showed them that it would work. I did not complete the code for them instead I set up the loop so that it would work how they wanted and told them to sort the code out so it worked using the loop. I gave this help at the end of the session and as it was in CLA A’s class I will not be able to check if they have managed to get this to work but I will make sure I as CLA to check when they are next in.",
            "Some of the teams were spending their time in this session working on their report and as a result did not need any help with the development of their project, however I did say that if they had any questions about the report I would be able to help. The teams that used this session to work on the report said that their game was either done or very close to being finished, as a result of this I asked to see their game to make sure that they work as well as to view the progression they had made. All of the games that I viewed from the teams that chose to work on the report only required small additions or bug fixes to be considered finished games and would allow for the report produced to be comprehensive and detailed so I had no issues with them carrying on. The questions about the report had to do with clarification of the marking criteria as some of the points in it did not make much sense to the students. For the questions about the report I made suggestions for what the different parts of the criteria meant and how to best approach producing it, I made sure I did not give too much help so that they would have to put the work in for themselves."
        ]
    },
    {
        "Date":"27/11/18",
        "Text":[
            "This class started with the students being told to use eclipse to write a hello world program. The majority of the students struggled first to find the program in the apps folder and then chose the wrong version of eclipse. Because of this I spent the start of the class helping the students to get started with eclipse so that they could complete this task. The next issue faced by the students was the fact that they were unable to set up the project to use the right Java Runtime Environment(JRE) this was due to them not understanding the program fully. I helped the students to get started so that they would be able to complete the task, after the correct JRE had been set up the students were able to get the code written. A few of the students struggled with the println by putting a i instead of an l, but after pointing out that it is supposed to stand for print line they managed to fix it themselves.",
            "One of the students went above and beyond what had been asked by writing a program to accept and print user input as well as adding in a way to conduct maths from this input. I asked this student if their team had finished the work that they needed to complete for the lesson, as in the game and report, and they quickly checked with their team. This student then got back to playing about, as they had done a lot of the work they needed to I gave them help and pointers with what they were trying to do so that they could continue to play about.",
            "The class as a whole finished the eclipse task quickly with some students being able to understand what it is they needed to do and others needing a bit of a push in order to get it. The Task given to the students did not take very long at all and as a result they were able to spend most of the time working on the project for this module; However, a number of students used the time in this class to finish the group work that they had due for a different module. I made sure that the students that were not working on the project for this class had completed the eclipse task and knew what they needed to do for the project required for this class. At the end of this calls I was asked to remind the students as to what they had to produce for this class as well as the dates they needed to have this done by, I also told the students that they could leave."
        ]
    },
    {
        "Date":"04/12/18",
        "Text":[
            "This class was the last before the students had to have finished their Alice project and as a result a large number of students were using this time to complete the programming portinon. The students asked for a lot of help during this session, with most of them having issue that they needed solved in order to call the work complete. I spent my time in this session making sure I was available to help the students where need be which allowed me to see how their work was getting on. The main bulk of the issues the students asked for help with were to do with the way Alice dealt with the looping of their program and as a result needed a large amount of time dedicated to reaching a point the program worked correctly. With this class being possibly the last one where help would be available a number of students that had not turned up to previous sessions were present in this one and required quite a bit of help with what they were working on.",
            "With the majority of this lesson being about solving issues with the programming several bugs were found within Alice, one of which should not be possible. The most interesting of these was a bug in which the program was stopped and never started again but continues to run in the background, after the scene had been closed, this caused the students computer to use up 100% of the CPU and nearly crash. When the issue was fixed and the program could compleat again the instances that had been running in the background all completed one after the other. The issue passed this were to do with the way the issues were being addressed but this in of itself would have been a computer breaking bug if it had not been addressed.",
            "The students were split in the work they were completing with a number focusing on the project for this lesson, either on the game or the presentation. The work completed in this lesson was however not focused on it as a number of classes have deadlines approaching so the students focused on the work that for them was most pressing. I did not need to help any of the students working on other work but did help some students with their presentations as well as the report. The help I offered was more in the vein of direction and suggestion with no questions being answered directly. The help I offered was well received with the students having a better idea of what they needed to produce as well as feeling more confident about the work they had completed."
        ]
    },
    {
        "Date":"21/01/19",
        "Text":[
            "This class began slowly with the GTA taking a little bit of time to turn up for the session, However most of the students turned up early for this class and were waiting outside before the start of the session. The class started out with most of the students logging on and opening eclipse to start to look for the work that they had to do. The work required for today was to follow a tutorial on lynda.com / linkedin learning; However this did not work at all. The majority of the students could not get their accounts set up correctly so could not get through to the tutorial at all. With this lesson being focused on the tutorial there was no other work set out for the students to do meaning the students were told that they could leave if they could not get it working. The hope is that next week this issue will be fixed but if not there doesn't seem to be any alternative for the students to do."
        ]
    },
    {
        "Date":"28/01/19",
        "Text":[
            "This class was the first to have the tasks for eclipse given to the students so that they could start programing with the IDE. The tutorial that the students had to follow ran through the basis of both using eclipse and outputting data to the console using java. The majority of the students had some difficulty in building the first project while following the tutorial as the default selection for this caused the build path to break. The fix was easy and quick to apply with the second option needing to be chosen. There was only one student that struggled with this but not due to choosing the wrong option, it was more a case of ignoring the finish button but after this was pointed out they were able to continue.",
            "The programming in this lesson saw the students using System.out.println which caused some issues as a number of students used other letters instead of ‘l’ leading to pritnin etc. When asked about this I pointed out the mistake and said that the line was supposed to be print line but was shortened, after this there seemed to be no more issues. The next problem the students faced was in regards to printing a backslash as part of the ascii art. Most of the students didn’t read the error and instead immediately asked for help when the print didn’t work. With this issue I highlighted the error and explained the that the use of a backslash in a print informs the compiler of an action to be performed on the string and as there was no command it didn’t know how to process it. I informed the students that this error can be fixed by adding a second backslash and then had assure them that the program would only print one backslash. The last part of this tutorial was to print out a tick tac toe board which is comprised of seven lines made from two distinct different lines. With the tick tac toe board the students tended to print out each line to produce the desired outcome and while this works it is not the best way to achieve the desired effect. There were a few students, student D included, that chose to use for loops and a modules function in an if statement as every even number would represent one of the lines and every odd the other.",
            "This lesson did not have as much as badly as the last as the students had a tutorial to follow and could get on with work. The linkedin learning site is still not allowing the majority of students access so they still can’t use the tutorials on the site. This appears to have been glossed over as it has not been mentioned by the GTA, most of the students don’t seem to have any opinion of the matter. The class overall relied on asking myself or the other CL for help when they needed it which helped to keep the class running smoothly. From the students I have spoken to they are wanting to get started with more complex programming tasks so I feel the effort and engagement in the lessons will pick up with the difficulty of the tasks."
        ]
    },
    {
        "Date":"04/02/19",
        "Text":[
            "This class had the students continuing to work though the programming tasks they have been given with each of these having a number of different parts the students needed to complete. The majority of the students were able to get underway with this work without issue however a number had some problems around getting eclipse to work; there was also an issue overall with the use of eclipse from the network as it kept freezing for a number of students. The main fix used was to restart eclipse which seemed to work in most instances.",
            "The tasks that the students had to complete for this lesson involved some new programming practise but were primarily comprised of things the students had previously learnt. With this in mind it was assumed that they would be able to make good progress and require minimal input or help.The students managed to get the main points but only after making the mistake of copying and pasting the code from the lab book, which caused issue as there are errors in the tutorial to get the students to think. With students that were copying and pasting I went over why this does nothing to help them learn and pushed them towards reading over what was needed and reproducing it. When it came to the twelve days of christmas task a number of students found converting the switch and case statements to if statements difficult so required a push in the right direction but once it had been pointed out only needed help with sorting out the logic they built."
         ]
    },
    {
        "Date":"11/02/19",
        "Text":[
            "This lesson focused on the GUI aspect of java with the students being asked to produce a calculator using eclipse and java. The students ended up having a problem with this as the required runtime environment for java, 1.7, was not properly installed. This issue to a large amount of time to firstly find and then fix, the library required existed and could be found easily but was not connected. The issue was resolved one computer at a time, the students were told what was needed then I went round and ensured that they had fixed the problem or helped them.",
            "Most of the students were able to get going with this weeks task quickly and managed to get a lot done with minimal input. A surprisingly large number of students (5) left within the first 15 minutes of the class for no real reason. I tried to confront two who claimed they were getting food and would be back, which did not happen. Overall the students that remained in the class were able to complete the required tasks. One student was completing a task that should have been submitted, I mentioned this and helped them as I would have otherwise so they still learnt what they were supposed to. Due to the students getting to grips with coding and using eclipse there was a lot less asked of me this session so I was able to help where students looked like their understanding was lacking with one student Student E saying they had done more reading outside of class after I had suggested it and that this had helped.",
            "With this session I used some of the time to look at both CLA and CLB to find out what pedagogical approach they take to teaching. This saw me go between two classes to observe both CL’s as well as conducting my normal classroom tasks. Both sets of students asked me for help when I could be found which I provided whilst checking over how the others were helping the students. Both CL’s conduct themselves well in the classroom and have repor with the students which I feel helps when when the students need help or have questions. I have been able to place both of them into working in a specific way but will write about this more in the report. "
         ]
    },
    {
        "Date":"18/02/19",
        "Text":[
            "This class was termed as optional for the students so this session was intended to be used as a support for any students that felt they required it. As a result of the students being told the class was optional the session ended up being quite empty with the students that did attend only doing so for a place to do work. There were a number of students that did have questions about the work they were trying to complete, with these students tended to have some problems with the programming aspects of the work they needed to complete.",
            "The problems that required help within this class where to do with the GUI output for the calculator and understanding what is required to be completed. A number of the issues came about due to the students struggling to understand how to implement the gridbag layout option, this had a lot of the students struggling to find a way to get the GUI to look how they wanted. The layout issues required a little bit of input before the students started to piece together what they would need to do in order to get this working correctly. The help given was focused on finding issues in the code as well as suggesting ways in which they could attempt to fix the problems they were facing."
         ]
    },
    {
        "Date":"25/02/19",
        "Text":[
            "This programming class had the students starting to work on building up the calculators functionality which required an understanding of creating classes as well as exceptions. The focus of this session had a number of students making quick progress and then running into an issue that they could not find a way to solve. With this session being about the logic the issues that the students were facing could be found in their code with errors in the way it was written being found as the source of the problems. This class had a number of students missing from it with most of the students that did not turn up being those that tend to avoid the lesson.",
            "The students that attended this class managed to make a large amount of progress with the work that they needed to complete. Some of the students felt that they had finished what was required, with this being the case it was suggested that they put time into improving how the calculator worked (allowing for multiple numbers) and exploring different ways to implement the functionality. The push to add more to the calculator had a number of students say that they would put time in outside of the session to put this in place. Overall the students that attended this class were engaged and seemed to have a good understanding of what was required for this session."
         ]
    },
    {
        "Date":"04/03/19",
        "Text":[
            "This class had the students interacting with file paths within java with this work starting to be connected to the group work that the students will start to undertake in the next couple of sessions. The use of file structures within java is not a complicated idea but the way that it is presented in the tutorial books lead a lot of students to struggle to get to grips with how to use it. The tutorial included file paths that no longer existed so most students ended up saying they could not get it working , as they had copied the code directly. The file path in the tutorial not being present on the network as well as some students using laptops meant they needed to be told that they could use any path and just needed to show that they could navigate a file structure with java.",
            "The GTA for this lesson halfway though told the students that if they had completed at least half of the required work could leave after eleven. This came with the pretext that the students had to show the work they had completed so far to the GTA or one of the CL. The reasoning behind this is the fact that the majority of the students leave the class halfway thought, normally sneaking out, anyway so having them show their work might mean they will take the lesson more seriously. There was only one student that took advantage of this for this session and had both completed half the work and could explain what else they needed to do to finish the task. The students that stayed for the full class were able to finish all of the work required meaning they had less to do outside of the session.",
            "The students that said they would add more to the calculator produced in the last session showed this off during this one, only to myself. The addition to the calculator made by Student D allowed for multiple numbers to be used allowing for complex calculations to be input to the calculator. The student said that this had taken about eight hours but that they had found the whole process helped their understanding of coding as well as the work that they were being asked to complete."
         ]
    },
    {
        "Date":"011/03/19",
        "Text":[
            "Before the start of this class all of the CLs were moved to a new class so that we would have a new group of students to teach. The reason for this was to take us out of our comfort zone and see how well we adapted to a classroom where the students did not know us and were used to a different CL. The students in this class appears to be surprised at the start as they were expecting CL C and CL D, which three students commented on. due to the students not knowing me none of them felt comfortable asking me for help thought the first part of the lesson. This class seemed a little behind with their understanding of programing, when compared to the last class I helped in.",
            "The majority of my time was spent walking around the room looking for students that were struggling with the task, with these students I first asked if they needed any help so that I didn’t barge in if they were working though it. Most of the students were receptive to the advice I gave about the problems within their code but a few of them did not seem to be able to take the advice on board to help fix the issues. One student repeatedly asked for help throughout the lesson with the same or similar issues which lead to the help given being reduced as there would be no benefit to only this student receiving help. After a few occasions of me asking students if they needed help they started to ask me if I could help them which also lead to them feeling more comfortable with me."
         ]
    },
    {
        "Date":"18/03/19",
        "Text":[
            "This class was the second with this group of students which meant they had gotten over the fact that I am not the CL that they had previously had.  With this lesson I had been asked to get the students feedback on feedback so before the lesson I told the GTA that I would be asking the students some questions before the start of the lesson. At the start of this lesson I went round handing out post-it notes to each of the students, after each student had enough I told them that I needed them to write down their answers to the questions “what is feedback?”, “how is feedback given and what is your prefered method?” and “how quickly do you want feedback?”. All of the students apart from one gave their answers to the questions with all of the post-its being collected and handed in so that the feedback could be recorded.",
            "After the questions the lesson continued as normal with the students being told that they would now be working on the team project that they had chosen. To find out what projects the students would be undertaking I asked each group, every group in this lesson said that they would be working on the space invaders project. The reasons that the students gave for this decision was primarily that they did not feel they had enough time to work together on the robot project as the easter holidays would take up a large amount of the time. While this class was told that this lesson would be the first that they would have to work on the team project only one team began work on any part of it with them starting the programing and sorting out how they would split up the work. Most of the other groups spent the time in this lesson reading through the requirements for the project with a number of questions being asked about what it is they would need to achieve and what would be required."
         ]
    },
    {
        "Date":"25/03/19",
        "Text":[
            "This class was the second to have the students working on their group work project which should have meant a full class as they do not have long left to finish this work. The class for this session had 12 out of the near 20 students that it should have and 4 of these left before the end of the session. The groups that did attend the lesson were all working on the space invaders game for the project with varying levels of completion. One team has been able to get the player and monsters to spawn and move within the frame with this session being focused on debugging this as well as setting work for the team members. There is one student in this class that has not had any contact from the other members of their team and as a result has requested to work on their own for this project work, they have been told to ask the program lead about this.",
            "The help required by the students in this session revolved around helping them to setup the development environment to allow for all aspects of the space invaders game to be built. By the end of this lesson there were three teams that had managed to get the window to open as intended and had the methods setup so that they could start the development. The teams needed reminding that they also had to write a report on the work that they were completing with all the teams adding this to the list of things they would split between the members. The students are all worried about the amount of time they have to complete the work as there is only one class where they could receive support."    
         ]
    }
]